In [6]:
#pip install mysql-connector

In [ ]:
#Insert multiple row in data set

# (2, 'Sakshi Yeshal', datetime.date(2000, 5, 19), datetime.date(2021, 4, 26)
# (3, 'Sourabh Yeshal', datetime.date(1999, 11, 5), datetime.date(2021, 8, 21)
# (4, 'Vaishnavi Yeshal', datetime.date(2002, 5, 11), datetime.date(2018, 2, 12)
# (5, 'Sumit Yeshal', datetime.date(1998, 4, 9), datetime.date(2021, 7, 21)

In [5]:
import mysql.connector

def insert_varibles_into_table(STUDENT_NO, STUDENT_NAME, STUDENT_DOB, STUDENT_DOJ):
    try:
        connection = mysql.connector.connect(host="remotemysql.com",
                                             user="wx2j0z2kNU",
                                             password="tZrl2EMoOV",
                                             port = "3306",
                                             database= "wx2j0z2kNU")
        cursor = connection.cursor()
        mySql_insert_query = """INSERT INTO STUDENT (STUDENT_NO, STUDENT_NAME, STUDENT_DOB, STUDENT_DOJ) 
                                VALUES (%s, %s, %s, %s) """

        record = (STUDENT_NO, STUDENT_NAME, STUDENT_DOB, STUDENT_DOJ)
        cursor.execute(mySql_insert_query, record)
        connection.commit()
        print("Record inserted successfully into STUDENT table")

    except mysql.connector.Error as error:
        print("Failed to insert into STUDENT table {}".format(error))



insert_varibles_into_table(1, 'Rohit Chilka', '2000-04-05', '2019-04-14')
insert_varibles_into_table(2, 'Sakshi Yeshal', '2000-05-19', '2021-04-26')
insert_varibles_into_table(3, 'Sourabh Yeshal', '1999-11-05', '2021-08-21')
insert_varibles_into_table(4, 'Vaishnavi Yeshal', '2002-05-11', '2018-02-12')
insert_varibles_into_table(5, 'Sumit Yeshal', '1998-04-9', '2021-07-21')

Failed to insert into STUDENT table 1062 (23000): Duplicate entry '1' for key 'PRIMARY'
Record inserted successfully into STUDENT table
Record inserted successfully into STUDENT table
Record inserted successfully into STUDENT table
Record inserted successfully into STUDENT table

In [10]:
import mysql.connector
mydb = mysql.connector.connect(
  host="remotemysql.com",
  user="wx2j0z2kNU",
  password="tZrl2EMoOV",
  port = "3306",
  database= "wx2j0z2kNU"
)

In [ ]:
# STUDENT List by using for loop

In [11]:
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM STUDENT")

for x in mycursor:
  print(x)

(1, 'Rupali', datetime.date(1998, 9, 17), datetime.date(2021, 6, 11))
(2, 'Sakshi Yeshal', datetime.date(2000, 5, 19), datetime.date(2021, 4, 26))
(3, 'Sourabh Yeshal', datetime.date(1999, 11, 5), datetime.date(2021, 8, 21))
(4, 'Vaishnavi Yeshal', datetime.date(2002, 5, 11), datetime.date(2018, 2, 12))
(5, 'Sumit Yeshal', datetime.date(1998, 4, 9), datetime.date(2021, 7, 21))
(7, 'Kaustubh', datetime.date(1998, 6, 5), datetime.date(2013, 3, 3))
(9, 'Sneha  dudhe', datetime.date(1997, 5, 11), datetime.date(2016, 3, 12))
(14, 'Dummy Stud', datetime.date(2021, 7, 26), datetime.date(2021, 7, 27))
(24, 'SAM', datetime.date(2001, 6, 13), datetime.date(2020, 5, 18))

In [23]:
# Update perticular row from STUDENT table by using update query
import mysql.connector
mydb = mysql.connector.connect(
  host="remotemysql.com",
  user="wx2j0z2kNU",
  password="tZrl2EMoOV",
  port = "3306",
  database= "wx2j0z2kNU"
)

mycursor = mydb.cursor()

updateRow = "UPDATE STUDENT SET STUDENT_NAME = 'Abhishek Yeshal' WHERE STUDENT_NAME = 'Sakshi Yeshal'"
mycursor.execute(updateRow)

mydb.commit()

print(mycursor.rowcount, "Record(s) Updated")

1 Record(s) Updated

In [24]:
#List of updated STUDENT TABLE
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM STUDENT")

for x in mycursor:
  print(x)

(1, 'Rupali', datetime.date(1998, 9, 17), datetime.date(2021, 6, 11))
(2, 'Abhishek Yeshal', datetime.date(2000, 5, 19), datetime.date(2021, 4, 26))
(3, 'Sourabh Yeshal', datetime.date(1999, 11, 5), datetime.date(2021, 8, 21))
(4, 'Vaishnavi Yeshal', datetime.date(2002, 5, 11), datetime.date(2018, 2, 12))
(5, 'Sumit Yeshal', datetime.date(1998, 4, 9), datetime.date(2021, 7, 21))
(7, 'Kaustubh', datetime.date(1998, 6, 5), datetime.date(2013, 3, 3))
(9, 'Sneha  dudhe', datetime.date(1997, 5, 11), datetime.date(2016, 3, 12))
(14, 'Dummy Stud', datetime.date(2021, 7, 26), datetime.date(2021, 7, 27))
(24, 'SAM', datetime.date(2001, 6, 13), datetime.date(2020, 5, 18))

In [27]:
# To Delete perticular row from STUDENT table
mydb = mysql.connector.connect(
  host="remotemysql.com",
  user="wx2j0z2kNU",
  password="tZrl2EMoOV",
  port = "3306",
  database= "wx2j0z2kNU"
)
mycursor = mydb.cursor()

deleteRow = "DELETE FROM STUDENT WHERE STUDENT_NAME = 'Vaishnavi Yeshal'"
mycursor.execute(deleteRow)
mydb.commit()

print(mycursor.rowcount, "Record(s) Deleted")

1 Record(s) Deleted